Revit 2024 API
BuiltInFailures.MEPCalculationFailures.InvalidFluidProperty Property
 Some network components may have a flow value of 0 (zero), due to invalid value settings for fluid Dynamic Viscosity or Density. \nVerify that you have selected the correct fluid type and that the fluid Dynamic Viscosity and Density values are set correctly in the Mechanical Settings dialog.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidFluidProperty { get; }
Visual Basic
Public Shared ReadOnly Property InvalidFluidProperty As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidFluidProperty {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace